{
  "factory": {
    "id": "adapter",
    "name": "Adapter pattern",
    "description": "Adapter pattern works as a bridge between two incompatible interfaces. This type of design pattern comes under structural pattern as this pattern combines the capability of two independent interfaces.<p/>This pattern involves a single class which is responsible to join functionalities of independent or incompatible interfaces. A real life example could be a case of card reader which acts as an adapter between memory card and a laptop. You plugin the memory card into card reader and card reader into the laptop so that memory card can be read via laptop.",
    "implementation":"",
    "files": [
    ]
  },
  "bridge": {
    "id": "bridge",
    "name": "Bridge pattern",
    "description": "Bridge is used when we need to decouple an abstraction from its implementation so that the two can vary independently. This type of design pattern comes under structural pattern as this pattern decouples implementation class and abstract class by providing a bridge structure between them.<p/>This pattern involves an interface which acts as a bridge which makes the functionality of concrete classes independent from interface implementer classes. Both types of classes can be altered structurally without affecting each other.",
    "implementation":"",
    "files": [
    ]
  },
  "composite": {
    "id": "composite",
    "name": "Composite pattern",
    "description": "Composite pattern is used where we need to treat a group of objects in similar way as a single object. Composite pattern composes objects in term of a tree structure to represent part as well as whole hierarchy. This type of design pattern comes under structural pattern as this pattern creates a tree structure of group of objects.<p/>This pattern creates a class that contains group of its own objects. This class provides ways to modify its group of same objects.",
    "implementation":"",
    "files": [
    ]
  },
  "decorator": {
    "id": "decorator",
    "name": "Decorator pattern",
    "description": "Decorator pattern allows a user to add new functionality to an existing object without altering its structure. This type of design pattern comes under structural pattern as this pattern acts as a wrapper to existing class.<p/>This pattern creates a decorator class which wraps the original class and provides additional functionality keeping class methods signature intact.",
    "implementation":"",
    "files": [
    ]
  },
  "facade": {
    "id": "facade",
    "name": "Facade pattern",
    "description": "Facade pattern hides the complexities of the system and provides an interface to the client using which the client can access the system. This type of design pattern comes under structural pattern as this pattern adds an interface to existing system to hide its complexities.<p/>This pattern involves a single class which provides simplified methods required by client and delegates calls to methods of existing system classes.",
    "implementation":"",
    "files": [
    ]
  },
  "filter": {
    "id": "filter",
    "name": "Filter pattern",
    "description": "Filter pattern or Criteria pattern is a design pattern that enables developers to filter a set of objects using different criteria and chaining them in a decoupled way through logical operations. This type of design pattern comes under structural pattern as this pattern combines multiple criteria to obtain single criteria.",
    "implementation":"",
    "files": [
    ]
  },
  "flyweight": {
    "id": "flyweight",
    "name": "Flyweight pattern",
    "description": "Flyweight pattern is primarily used to reduce the number of objects created and to decrease memory footprint and increase performance. This type of design pattern comes under structural pattern as this pattern provides ways to decrease object count thus improving the object structure of application.<p/>Flyweight pattern tries to reuse already existing similar kind objects by storing them and creates new object when no matching object is found. We will demonstrate this pattern by drawing 20 circles of different locations but we will create only 5 objects. Only 5 colors are available so color property is used to check already existing Circle objects.",
    "files": [
    ]
  },
  "proxy": {
    "id": "proxy",
    "name": "Proxy pattern",
    "description": "In proxy pattern, a class represents functionality of another class. This type of design pattern comes under structural pattern.<p/>In proxy pattern, we create object having original object to interface its functionality to outer world.",
    "files": [
    ]
  }
}